# Railing Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing Class
Members See Also
---
Represents a railing element in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class Railing : Element
```

Visual Basic
---
```text
Public Class Railing _
	Inherits Element
```

Visual C++
---
```text
public ref class Railing : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Architecture..::..Railing
# See Also
Railing Members
Autodesk.Revit.DB.Architecture Namespace